{
  "jobs_item": [
  {
    "id": "164676a4-74eb-42d6-9844-3d26f0a78a85",
    "type": "Part Time",
    "url": "https://jobs.github.com/positions/164676a4-74eb-42d6-9844-3d26f0a78a85",
    "created_at": "Wed Oct 21 01:27:30 UTC 2020",
    "company": "Foxo",
    "company_url": "https://foxo.com",
    "location": "Remote",
    "title": "Part Time DevOps Engineer ",
    "description": "About Foxo\nOur SaaS platform is changing the way doctors, nurses, and allied health connect, communicate and collaborate. We’re building a connected future for the Health industry.\nWhat is Foxo? If Microsoft Teams, Slack, and Google Docs merged into one easy to use health-specific platform, you’re halfway there.\nWith support from Australia’s greatest tech entrepreneur, recognition from the Australian Federal Government, we’re growing fast and need experienced Devops to help our journey.\nPosition Description:\nWe’re seeking an Experienced DevOps Engineer to bring our real-time communication platform to the world. We need a professional help build and maintain CI / CD pipelines and enable automation across our stack. This position has a strong emphasis on collaboration and striving to achieve industry best practices, especially in areas of security and availability.\nThis is a career defining opportunity to be part of a high profile start up with a high growth trajectory and is already awarded and well recognised across the industry. This part-time position is for 2.5 days per week, there is an opportunity of becoming full time.\nDay to day:\n\nFoxo’s DevOps requirements are still growing, hence this isn’t a full time position. We’ll work with you on your availability to service the team and product’s requirements.\nWorking remotely, you’ll be embedded in the engineering team and work closely with Foxo’s founding engineer and senior backend engineer to continuously develop and improve Foxo’s SaaS offering\nYou’ll drive and enhance an existing portfolio of tools while providing expert advice to help future proof product scale, service a growing user base, and new market entrance\n\nSkills / Experience:\n\nA team player who understands current mobile and web application concepts\nExperience of the software development process including CI and automated deployments\nHigh availability, fault tolerant and redundant systems \nAWS (EB, EC2, CloudFront, RDS)\nTools such as GitHub, Github Actions or similar CI automation tools\nExposure Vue.js, Node.js, React/Redux, Single Page Applications (SPAs)\nKnowledge of PostgreSQL and how to tweak it at scale\nCI/CD pipelines\nAutomation\nCloud Infrastructure System Deployment\nTooling like Ansible, Terraform, AWS Cloudformation, Docker &amp; Bash\n\nExperience:\n\nExpert understanding of AWS\nHealth sector or startup landscape is regarded\nHIPAA compliance is very highly regarded\nPractical knowledge of technical security controls and how to apply them\n\nBenefits:\n\nJoin a collaborative, flat structured team environment with people who truly love what they do\nCompetitive salary and package\nAccess to an employee share option plan\nGrow with us - Significant internal growth opportunity within the company\nCasual work environment with flexible working hours\nAn award winning product that improves the lives of customers and patients\n100% remote - We don’t plan on opening an office any time soon\nAbility to discover your strengths, follow your passion and own your own career\n\nMore on Foxo\nFoxo delivers powerful communication for healthcare teams, administrators, and organisations. Much more than secure messaging, the platform features clinical system integrations, patient centric workflows, and collaboration tools designed to reduce administration, enhance operational efficiencies and improve patient outcomes.\nOur focus has been to deliver a neutral platform which connects siloed software, healthcare teams, departments, and organisations across an open network of users in real time.\nThe team at Foxo are dedicated, passionate, and grounded:\n\n\nDedicated to changing the outdated communication practices in medicine\n\nPassionate about improving patient care by solving long-standing challenges\n\nGrounded in believing great teamwork and collaboration leads to great success for everyone\n\n",
    "how_to_apply": "Visit Foxo.com/careers to apply for this position or email <a href=\"mailto:hello@foxo.com\">hello@foxo.com</a>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbk9NIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e535d03e19a22d12d52ae65d0617ae0ada463c41/foxo-1000x1000.png"
  },
  {
    "id": "18853f8f-4606-46c0-9aaa-f1c9f80eb21e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/18853f8f-4606-46c0-9aaa-f1c9f80eb21e",
    "created_at": "Tue Oct 20 18:06:33 UTC 2020",
    "company": "The Barnes Foundation",
    "company_url": null,
    "location": "Philadelphia, PA",
    "title": "Lead Web Developer",
    "description": "Description: The Lead Web Developer will architect cutting edge technology initiatives for an art museum setting committed to innovative and inclusive learning for in-person and virtual visitors.  This role will lead initiatives including web, Business Intelligence, machine learning and digital engagement.\nThe Lead Web Developer will have a breadth of knowledge across modern platforms and technologies, be self-motivated and continually develop their understanding of emerging technologies, seeking to adhere to best practices in front-end and back-end coding, systems architecture, and deployment. This position reports to the Chief Technology Officer and will work with a variety of teams and partners across multiple disciplines.\nBeyond coding skills, this position will manage multiple projects in parallel and lead them through to completion and product release, including: coordinating meetings and launches with involved teams and stakeholders, gathering requirements and use-cases, conducting code reviews, ensuring reliability and extensibility of applications, and other inspections necessary to ensure projects meet established technological standards and accessibility standards.  In addition to working on internal web projects, the Lead Web Developer is responsible for defining internal standards and guidelines designed to foster maintainable coding practices and system design while ensuring these standards are implemented across all consultant projects in addition to internal ones.\nEstablished as an educational institution, the Barnes Foundation carries out its mission by promoting appreciation of the arts and horticultural science, through the preservation, presentation, and interpretation of the collections of Albert C. and Laura L. Barnes.\nCelebrated for its exceptional breadth, depth, and quality, the Barnes Foundation’s art collection includes works by some of the greatest European and American masters of impressionism, post-impressionist, and early modern art, as well as African sculpture, Pennsylvania German decorative arts, Native American textiles, metalwork, and more.\nThe Foundation engages diverse audiences through its exceptional collections and related high-quality programs that reflect a broad range of periods and cultures and build on the founders’ innovative educational vision of transforming lives through the arts and horticulture.\nResponsibilities:\nJob Specific Competencies:\n\nResponsible for maintaining the foundation’s Craft CMS and main website, collections website and various existing microsites, web applications, and other technology initiatives.\nMaintains and develops new web and cloud-deployed applications at the foundation for a number of new technology initiatives ranging being from web, mobile, and data-processing focused.\nFostering maintainable coding practices and system design while ensuring these standards are implemented across all vendors and consultants.\nCoordinates with distributed teams and act as the point-of-contact to ask and answer technical questions between these teams and key stakeholders.\nDeploy and integrate applications into existing cloud infrastructure.\nManagerial responsibilities including leading and guide a small but nimble team to deliver well-built products on-time.\nEnsuring proper and optimal delegation of responsibilities to team under your supervision and achievement of project goals in suitable deadlines.\nAbility to shift gears and context switch as required by long-term projects, short-term goals/tasks, and occasional troubleshooting/resolution.\n\nSkills and Knowledge:\nRequired:\n\n2+ Years’ experience with\no\tTypeScript\no\tNode.js\no\tcreating and maintaining cloud-deployed applications (AWS highly preferred)\no\tdeveloping web application client-side and server infrastructure\nA desire to engage with stakeholders and turn business requirements into technical requirements and functional code\nExcellent communication skills; able to articulate complex technology concepts to non-technologists\nExperience with\no\tfrontend frameworks (React highly preferred)\no\tsource control management systems (GitHub preferred)\no\tuser authentication through client/server cookies and server-side sessions while meeting secure web practices\no\tcreating clear and concise code, documentation, and guidelines\no\tworking effectively with and leading remote teams\n\nPreferred:\n\nExperience working with\no\tThird-party REST APIs and API authentication schemes\no\tMySQL, PostgreSQL and Elastic Search\no\tAWS services including Lambda, RDS, S3, Elastic Beanstalk, API Gateway, among others for successful operation of the Barnes Foundation infrastructure\no\tAndroid Studio SDK/Kotlin\no\tCraft CMS, PHP/Twig, Python\no\tCSS style guides that can be used to share UI components across different teams\no\tunit and integration testing systems\no\tMicroservices/SOA architecture and best practices\n\nCompetitive Benefits Include: Group health, dental and vision insurance; flexible spending accounts; short- and long-term disability and group life insurance; 403(b) with matching contributions; Employee Assistance Program; voluntary benefits; as well as paid vacation, personal time, sick time and holidays.\nPlease include a cover letter and an updated resume with your application, along with salary expectations.\nThe Barnes Foundation is an Equal Opportunity Employer and we’re committed to diversity and equal opportunity in our recruitment and hiring. Qualified candidates of all backgrounds are welcome and encouraged to apply for this position. Employees have rights under other laws including, but not limited to, the Family and Medical Leave Act and the Employee Polygraph Protection Act. We participate in E-Verify.\n",
    "how_to_apply": "<a href=\"https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=57a31989-d414-4f1f-9309-a4a1f71a652d&amp;ccId=19000101_000001&amp;jobId=392953&amp;source=CC2&amp;lang=en_US\">https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=57a31989-d414-4f1f-9309-a4a1f71a652d&amp;ccId=19000101_000001&amp;jobId=392953&amp;source=CC2&amp;lang=en_US</a>\n",
    "company_logo": null
  },
  {
    "id": "a3fb4556-a1be-48dc-b4da-e3f439560ab5",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/a3fb4556-a1be-48dc-b4da-e3f439560ab5",
    "created_at": "Mon Oct 19 18:43:11 UTC 2020",
    "company": "AXIOS",
    "company_url": "http://axios.com",
    "location": "Remote (USA)",
    "title": "Director of Engineering",
    "description": "Quick Take: Axios is a growth-stage startup dedicated to providing trustworthy, award-winning news content in an audience-first format. We're hiring a Director of Engineering!\nWhy it Matters: Delivering great products means great passionate and talented technologists. The Director of Engineering will set standards for Axios while growing, coaching, and holding accountable the staff that delivers our compelling products.\nThe Details: Ideal candidates will embody an entrepreneurial spirit, a passion for Axios’ mission and will be responsible for the following:\nWork closely with Product, Design, and Engineering leadership to build a vision for technology at Axios\nPartner with Engineering Managers to set standards and define best practices\nHire, retain, support, and grow the engineering talent Axios needs to succeed\nCoach and mentor staff to help them grow in their abilities as they work with cross-functional product-oriented team members\nEnsure all engineers in your domain are delivering high-quality technical output\nOversee architectural process and help grow architectural skills across engineering\nPartner with engineers to plan, problem solve, and optimize for the best technical solutions\nDemonstrate excellent judgment in professional and technical decision making\nWeigh risk, maintainability, cost-impact, dev-impact, and business impact, to result in proposing the best possible solution\nPromote test-driven-development and prioritize strategies to reduce risk \nBe an authority on end-to-end systems architecture and modern pipeline design\nHold yourself and your team accountable to delivering high-quality, pragmatic results that meet the needs of the business in the timelines provided\nQualifications:\nProven track record with extensive experience as a software engineer, architect, and manager with deep, current technical experience \nExperience leading and managing multiple teams of developers in a fast-growth environment\nDeep, current technical capacity with software development, front-end architecture, data design and implementation, and enterprise-grade software delivery\nProven track record of creating pragmatic, maintainable systems, using industry-recognized best practices\nExperience shipping, maintaining, scaling, and evolving highly-utilized production products \nDeep experience applying agile practices to streamline team delivery and output\nSignificant, current knowledge of Python, Node related frameworks, and technologies\nExpertise in frontend technologies, specifically React and React Native\nExperience with Go or Native Mobile development, is a plus\nExtensive experience evaluating, implementing, and supporting third-party solutions for ad-tech, BI tooling, and general analytics a huge plus\nA passion for the Axios mission and media \nDon’t forget:\nCompetitive salary\nHealth insurance (100% paid for individuals, 75% for families)\nPrimary caregiver 12-week paid leave\n401K\nGenerous vacation policy, plus company holidays\nCompany equity\nCommuter and cell phone benefit\nA commitment to an open, inclusive, and diverse work culture\nAnnual learning and development stipend\nAdditional pandemic-related benefits:\nOne mental health day per month\n$100 monthly work-from-home stipend\nTele-mental health services \nOneMedical membership, including tele-health services \nIncreased work flexibility for parents and caretakers \nAccess to the Axios “Family Fund”, which was created to allow employees to request financial support when facing financial hardship or emergencies \nWeekly company-sponsored exercise and meditation classes \nVirtual company-sponsored social events\n",
    "how_to_apply": "<a href=\"https://grnh.se/029a4eb71us\">https://grnh.se/029a4eb71us</a>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaitNIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6cc0e96250117c5a25779da18ad1a2c5a2d98338/Axios%20logo%20-%20RGB%20-%20minimum%20space.jpg"
  },
  {
    "id": "438e1b17-68c1-410a-851e-280a73b1ef6e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/438e1b17-68c1-410a-851e-280a73b1ef6e",
    "created_at": "Thu Oct 15 13:48:08 UTC 2020",
    "company": "OrderMetrics",
    "company_url": "https://jobs.lever.co/bloom/0518e692-caad-489b-8f00-d2baaefcf42b",
    "location": "Remote (USA/ Canada)",
    "title": "Principal Software Engineer",
    "description": "Hi future colleague! My name is Krystyn Harrison, President at OrderMetrics. We’re looking to build the OrderMetrics team to help us in our mission to make it feel effortless for every digital merchant to grow their business.\nThousands of online shops around the world already use OrderMetrics to get an up-to-the-moment snapshot of their profit analytics and marketing performance. We’re honored to say many of our customers are obsessed with OrderMetrics—some even have our dashboard on a designated display in their office, so they can always keep an eye on their bottom line!\nWe’ve been around since 2016, but we’ve got big growth goals over the next few years. In service of that, we’re launching a whole new OrderMetrics in Q4 of 2020. It’s a complete refresh. A rebrand. A rebirth. A clean slate. We’ve got great bones, a clear value being delivered to our customers, and we’re rebuilding the guts of this business from the ground up, to help us grow even faster.\nOrderMetrics is a completely remote team, led by a stellar leadership team including VP of Customer Engagement Jordan Matheson and VP of Marketing Ryan Kopperud, and myself. In 2019, we were acquired by Assembly, which puts us in a uniquely funded position, and in the good company of a family of strong e-commerce software businesses.\nWe are looking to hire a Principal Software Engineer to manage and oversee the engineering team at OrderMetrics. This individual will report directly to the CTO and indirectly to the President at OrderMetrics.\nSound like a fit? Want to join our mission? Please apply. We’d love to chat. For those of you who crave a more traditional description, see below!\nWhat You'll Be Doing:\nWrite clear, well-tested, performant, and easy to review code\nTackle hard problems and deliver complete solutions\nManage, mentor, and oversee the engineering team at OrderMetrics\nScale the engineering team that is responsible for OrderMetrics front-end engineering and OM integrations\nResponsible for frontend software engineering strategy, and assisting in implementation\nResponsible for data acquisition strategy, and assisting in implementation\nBreak down work and spot issues early and your collaboration should make the entire organization faster, better, stronger.\nTake initiative working with other teams and functions to drive important changes through for our users and our colleagues, and spot places where we can work smarter without having to be asked.\nPrioritize well and help others on the team sort through what work is the most important, and help them stay focused.\nYou will work alongside a Product Manager to prioritize and build new features at OM and lead a small engineering team focused on customer support issues and new growth features in 2021\nRequirements:\n5-7 years of experience\nReact Native proficiency\nData acquisition and processing experience (Python a plus)\nAPI layer implementation experience (Node a plus)\nManaged projects in the past, strong ability to prioritize and scope work\nThe desire to roll up your sleeves and do great coding\nManage a small team of 2-3 engineers and provide mentorship and guidance\nAbility to communicate with multiple stakeholders - the ability to translate business/design requirements into technical requirements\nExcellent leadership skills, the ability to communicate effectively and coach others to improve (i.e., giving and receiving feedback is a core skillset of yours)\nBonus if you have:\nAWS knowledge\nExperience with Elastic EMR (Amazon tool for Hadoop)\nDomain expertise - in business intelligence saas or fintech (e.g., Wave Accounting, Freshbooks, etc.) and ideally in e-commerce\nCompensation Our salary band is $150k to $200k CAD annually. We are flexible, so please apply if you think you’re the right person!\nHow We Hire OrderMetrics is a remote-friendly office with flexible hours - for this role we will consider all applications from those based in Canada and The United States. OrderMetrics looks for creative and intelligent minds who will contribute to defining the future of E-commerce business. Once you’ve applied, if we like what we see, you’ll have a phone chat with a Talent Advisor at Bloom, and then a couple of meetings with the team. We’ll take you through the exciting expectations of this role and how you can make an impact, then we make an offer. We believe in moving fast! OrderMetrics is an equal opportunity employer. We are committed to creating a diverse and inclusive work environment and welcome members of all backgrounds, disabilities, and perspectives to apply.\n",
    "how_to_apply": "<a href=\"https://jobs.lever.co/bloom/0518e692-caad-489b-8f00-d2baaefcf42b?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/bloom/0518e692-caad-489b-8f00-d2baaefcf42b?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a>\n",
    "company_logo": null
  },
  {
    "id": "03b482a4-0951-4f98-b000-df3a7b5805cd",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/03b482a4-0951-4f98-b000-df3a7b5805cd",
    "created_at": "Wed Oct 14 23:01:33 UTC 2020",
    "company": "The Black Tux",
    "company_url": null,
    "location": "Santa Monica, CA",
    "title": "Sr. Software Engineer - Front End",
    "description": "The Black Tux is reinventing the formalwear rental industry so people can show up at their best on the days that matter most. The company designs and manufactures modern rental suits and tuxedos that actually fit—made of 100% wool, ordered online, and delivered for free. Using a combination of machine learning, tailor-trained fit specialists, and industry-leading customer service, The Black Tux guarantees a perfect fit every time.\nJust as we are on the modern edge of men's fashion, we also strive to stay on the modern edge of technology and are looking to hire a Senior Front End Engineer. As a Senior Front End Engineer at The Black Tux, you will specialize in building responsive and elegant web UIs to drive delight with our end users and impact for our business.\nWhat You'll Do:\n\nWork with React + Redux single page applications\nBe a leader and mentor to the other engineers on the team\nContribute to architectural and application design\nLead the evaluation process for new frameworks and their implementation\nBe the technical lead on large, business-critical features, and work closely with product managers and other team members to understand, articulate, and break down customer needs into technical requirements\nFocus on our end users and deliver features that excite them\nIdentifies anchors that are slowing the team and their execution, and proactively work with managers and counterparts to resolve them\n\nWho You Are:\n\n7+ years of professional software development\nBA/BS degree in Computer Science or related technical field or equivalent practical experience\nStrong proficiency in JavaScript and the JavaScript object model along with HTML and  CSS/SCSS\nThorough understanding of React.js and its core principles, along with popular React.js frameworks (such as Redux or Apollo)\nExperience with ES6 and Node.js\nExperience with common front-end development and build tools such as Babel, webpack, npm, Docker, etc.\nExperience with CI/CD environments and tools such as Jenkins, Codeship, CircleCI, etc.\nCollaboration with engineers, product, and design is a core part of your process\nLikes to work with fellow engineers to find the best solutions, and writes documentation on decisions made\nConversant in algorithms, software patterns, and their best usage\n\nYou May Also Have:\n\nExperience in one or more object oriented programming language (e.g. Python, Ruby, Java, C++)\nExperience with deploying and monitoring new applications with modern platforms, such as Kubernetes, AWS, GCP, and/or Heroku\nExperience with web performance optimization, accessibility, and SEO\nExperience with experimentation platforms and A/B testing\n\nBenefits + Perks of Working at The Black TuxExciting startup environment\n\nWeekly catered lunches\nDog friendly office\nComplimentary dry cleaning &amp; tailoring services\nHealth, dental and vision coverage\nPaid parking\nPaid maternity and paternity leave\nOpen vacation time\nStocked kitchen &amp; pantry\nApple equipment or whatever you need to be productive\nQuarterly team outings\nCompany happy hours\nFree suit rentals\n\nWe're an equal opportunity employer to all. We interview and hire applicants of all backgrounds, orientations, expressions, and identities.\n",
    "how_to_apply": "Please Apply Here:\n<a href=\"https://jobs.lever.co/theblacktux/b40a63bb-ff0d-4cbb-b13f-c51d4e44c689\">https://jobs.lever.co/theblacktux/b40a63bb-ff0d-4cbb-b13f-c51d4e44c689</a>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3lNIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--92eb89946203032fc817a47708a024f7a3a9aeb9/BlkTux_LogoBlk_transparent.png"
  },
  {
    "id": "c980f167-a984-4a1b-9a48-16119f9f0660",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/c980f167-a984-4a1b-9a48-16119f9f0660",
    "created_at": "Mon Oct 12 08:42:17 UTC 2020",
    "company": "de Volksbank",
    "company_url": "http:",
    "location": "'s Hertogenbosch",
    "title": "Frontend-developer",
    "description": "Klaar voor een nieuwe uitdaging? Als front-end developer ontwikkel je applicaties voor wonen, betalen en bankieren met een Angular-framework. En dat voor honderdduizenden gebruikers! Check de vacature.\nIs mijn salaris al gestort? Had ik het geld al overgemaakt? Mensen checken hun bankapplicaties steeds vaker. Soms zelfs tientallen keren per dag! Dankzij jouw werk als frontend-developer verloopt dat allemaal gesmeerd. Jij zorgt ervoor dat Volksbank-applicaties voor bijvoorbeeld internetbankieren en wonen er strak uitzien en dat klanten er probleemloos in kunnen navigeren.\nSamen met je collega’s bouw, test, beheer en documenteer je applicaties. Dit doe je met behulp van een breed scala aan frontend-ontwikkeltechnieken en onze eigen componentenbibliotheek op basis van Angular. Je werkt aan interessante projecten. Denk bijvoorbeeld aan de online Huismap, waarmee klanten en hypotheekadviseurs snel en simpel informatie en documenten met elkaar kunnen uitwisselen. Of aan Payconiq: een systeem waarmee je met je smartphone in winkels, online en aan vrienden kunt betalen.\nAls frontend-developer heb jij veel oog voor de klantbeleving van onze applicaties. Waar hebben gebruikers behoefte aan? Wat werkt goed – en wat juist niet? Hiervoor werk je nauw samen met vertegenwoordigers en productowners van de business en ben je regelmatig op ons hoofdkantoor in Utrecht. Met je collega’s werk je aan software die onze financiële dienstverlening aan klanten versnelt, vereenvoudigt en verbetert. Jouw vernieuwende ideeën zijn hierbij natuurlijk meer dan welkom!\n<h2>Hier kom je te werken</h2>\nJij gaat werken bij een van de scrumteams van de value-organisatie. Jouw team ontwikkelt applicaties die nodig zijn om veranderingen in de business te realiseren en implementeren op het gebied van betalen, wonen, finance en risk, en klantrelaties. Ook zelf zijn we volop in ontwikkeling. Zo beland je midden in de transitie naar DevOps-teams en krijg je de kans om mee te denken over verbetering en verandering. Hoewel je standplaats Den Bosch is, kan het zijn dat je ook regelmatig thuis of op onze locatie in Utrecht werkt.\n<h2>Jouw kwaliteiten</h2>\nEen nieuwsgierige, inhoud gedreven professional met een flinke dosis lef en een aanstekelijk enthousiasme. Dat ben jij in een notendop. Daarnaast beschik je over een kritische blik, het vermogen om complexe problemen te analyseren en de vindingrijkheid om eenvoudige creatieve oplossingen te bedenken. Oplossingen waar de klant écht iets aan heeft. Nieuwe technologische ontwikkelingen volg je op de voet, bijvoorbeeld doordat je onze lezingen, pizzasessies en hackathons bijwoont. Jouw kennis deel je graag. Iedereen kan bij jou rekenen op een helder verhaal. Want jij kunt je makkelijk inleven in anderen, of dat nou je backend-collega, een hypotheekadviseur uit de business of de klant is.\nVerder heb je:\n\nHbo werk- en denkniveau;\nMinimaal drie jaar ervaring met frontend-ontwikkeling;\nErvaring met frontend-ontwikkeltechnieken en -frameworks zoals: Angular, Jasmine, Protractor, Cucumber, SASS, BDD, TDD, NgRx, HTML5, JavaScript, TypeScript. stylesheets, CSS, SAS, NodeJS en Grunt of Gulp;\nBij voorkeur ervaring met backend-technologieën, zoals middleware, security, service-oriented architecture, Spring Boot en databases.\n\n<h2>Solliciteren?</h2>\nUpload je motivatie en cv via <a href=\"https://vonq.io/36TuFsY\">deze link!</a>. We nemen dan zo snel mogelijk contact met je op. Voor vragen over de sollicitatieprocedure kun je contact opnemen met onze recruiter Nikki Gunnink via 06-12656229 of <a href=\"mailto:nikki.gunnink@devolksbank.nl\">nikki.gunnink@devolksbank.nl</a>.\nAcquisitie naar aanleiding van deze vacature is niet gewenst.\n",
    "how_to_apply": "<a href=\"https://vonq.io/36TuFsY\">Klik hier om te solliciteren!</a>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc21MIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2757bda4ae0e16a4112f166f7ab02c027d46b540/Volksbank.jpeg"
  },
  {
    "id": "46ab84b4-12dc-4a95-ab08-422428554dfc",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/46ab84b4-12dc-4a95-ab08-422428554dfc",
    "created_at": "Fri Oct 09 19:42:30 UTC 2020",
    "company": "Playco",
    "company_url": "http://www.play.co",
    "location": "Remote",
    "title": "Senior Fullstack Engineer",
    "description": "Here at Playco, we make games that bring the world closer together through play.\nAs a Full Stack Engineer at Playco, you will play a pivotal role in creating a platform to revolutionize the instant games development industry. Our engineers are generally amazing at something and great at everything else. We write scalable backend systems, cross-compilers, JavaScript / TypeScript game APIs and tools, and whatever else it takes. No matter what you work on each day, you will work with the best engineers in the world; we have top talent in every part of our stack.\nThe Role\n\nBe responsible for designing, developing and deploying major game features.\nOwn game feature areas from end-­to­-end.\nBe the champion for the user!\nInsist on the highest standards and create functional and engaging features that will delight our users.\nBe part of a tight game development team looking to iterate fast on a fun concept and then building it out.\nHave real input on end-user product.\nBe a key member of a high performing software engineering team.\nCollaborate with design, engineering and production teams to devise optimal engineering solutions to game requirements.\nHands­ on architect and coder for sophisticated client/server systems for mobile gaming.\nInnovate and iterate on process, systems and technology to deliver world­-class social games.\nBe a leader; Identify and articulate technical and production risks and obstacles, as well as generate solutions!\n\nDesired Skills\n\nBachelor’s degree in Computer Science or related field, or equivalent experience.\n3+ years of professional software engineering experience.\nExperience writing clean, testable, high-quality code and designing highly scalable systems in production.\nCapable of JavaScript + HTML5 to create custom, interactive, user experiences that are enjoyable on all HTML5 browsers.\nProficient at using script debuggers like Chrome Debugger.\nSolid familiarity with deployment on cloud environments (AWS, GCP, Azure, etc.).\nStrong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.\nAdvanced software engineering skills, including the ability to write maintainable and robust code in a popular object oriented language.\nSolid familiarity with analytics and A/B testing in mobile games.\nFamiliarity with git, svn or other VCS.\nSelf starter, analytical and creative.\nStrong team player with a positive attitude.\nGood communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers and other developers.\n\nBonus\n\nExpert knowledge of NodeJS and ES6 / TypeScript.\nDevOps experience -- setting up CI/CD environments, orchestrating deployments, creating monitoring dashboards, anything that makes the development process easier, more enjoyable and more accountable.\nExperience in game development and shipped titles.\n\n",
    "how_to_apply": "<a href=\"https://jobs.lever.co/playco/453d2258-7e66-4f98-92e1-50e335c13302?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">Apply Here</a>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc2FMIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cb29d1ab0fec648aee52b0ad6e7ec0a0485551ca/Round_Logo1%20(1).png"
  },
  {
    "id": "18acad85-6cae-4e3d-8318-f87c821c87b1",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/18acad85-6cae-4e3d-8318-f87c821c87b1",
    "created_at": "Fri Oct 09 13:48:54 UTC 2020",
    "company": "Academic Work",
    "company_url": "https://www.academicwork.se/",
    "location": "Stockholm",
    "title": "Fullstackutvecklare",
    "description": "Group IT på Academic Work gör just nu något extremt spännande – vi bygger en helt egen plattform från scratch. För att lyckas med det på bästa sätt så jobbar vi med den senaste tech-stacken och de duktigaste medarbetarna och nu expanderar vi teamet för att säkerställa att vi tar oss till målet och att vi fortsätter ligga först när det gäller digitalisering i vår bransch!</em>\nOm tjänsten\nSom fullstackutvecklare hos oss blir du en del av ett riktigt bra team som alla jobbar mot samma mål; att bygga en plattform som ligger i framkant och som vi alla kan skryta med att vi varit med och byggt om några år. Vi tror att samarbete där alla bidrar med sina idéer och tankar är det bästa sättet så därför jobbar vi med mobb-programmering vilket innebär att du hos oss jobbar med utveckling i en dynamisk och kreativ miljö, där det aldrig blir tråkigt eller slentrian. Eftersom vi bygger från grunden så finns inget legacy att förhålla sig till och det gör också att frasen ”få vara med och bidra och vara kreativ” inte bara är en klyscha som passar bra i annonsen hos oss, utan faktiskt verklighet. Förutom det så jobbar du hos oss med branschens bästa tech leads, arkitekter och utvecklare!\nExempel på teknik som teamet idag har valt att jobba med är microservices, event driven architecture, containers, infrastructure-as-code och Linux. Vi arbetar gärna med OpenSource och programmeringsspråk varierar men NodeJS, Golang eller .Net core är språk de flesta hos oss känner sig mest bekväma med.\nGroup IT är idag runt 50 personer (runt 30 jobbar med produktutveckling varav 20 på utvecklingssidan) och sitter på Hälsingegatan i Stockholm. Du kommer att tillhöra utvecklingsteamet och rapportera till Head of System Development men arbetar dagligen i nära samarbete med tech leads och product managers och i dynamiska mobbar där du själv kommer kunna vara med och påverka vad du vill fokusera på framåt. Hos oss är stämningen familjär och trevlig och förutom att vi bygger riktigt bra saker tillsammans så har vi också väldigt kul om dagarna!\nVill du veta mer om hur det är att jobba internt på Academic Work? På <a href=\"https://www.academicwork.se/om-oss/karriar-hos-oss\">Jobba Hos Oss</a> får du träffa några av våra medarbetare, läsa om vad vi värderar högt samt se bilder och filmer som beskriver vår värld. <a href=\"https://www.academicwork.se/om-oss/karriar-hos-oss\">Klicka här!</a> Du kan också spana in vårt <a href=\"https://www.instagram.com/academicwork/\">Instagramkonto</a> och följ med bakom kulisserna på våra 16 kontor över hela Sverige. Varmt välkommen!\nArbetsuppgifter\nSom Fullstack-utvecklare kommer dina främsta arbetsuppgifter vara att:\n\narbeta med fullstack-utveckling genom att skriva bra kod och robusta tekniska lösningar samt leverera funktionalitet och värdeadderande lösningar till våra slutanvändare\nalltid ha ett nära samarbete och dialog med dina kollegor (tech leads, utvecklare, product managers, UX, platform)\nlöpande testa och utvärdera våra applikationer och tekniska lösningar och arbeta för att alltid förbättra dem.\n\nTjänsten passar dig som triggas av att bygga från grunden i en dynamisk miljö där du får stor frihet i att själv komma med idéer och som trivs med att arbeta i nära samarbete med ditt team.\nVi söker dig som\n\nÄr up-to-date med den senaste tekniken inom utveckling (fullstack) och arkitektur\nErfarenhet av JavaScript/TypeScript/NodeJS.\nHar tidigare erfarenhet/kunskap om SQL/NoSQL-databaser.\nHar goda kunskaper i svenska och engelska i både tal och skrift eftersom vi arbetar med mobbprogrammering där arbetsspråket i mobben är svenska\n\nOm du har arbetat med mobbutveckling och redan vet att du trivs med det så är det ett plus i kanten, men inget krav. En examen från högskola/universitet inom systemutveckling kan också vara användbart, men vi ser också att du kan ha fått dina kunskaper och färdigheter på annat sätt.\nVi erbjuder en kreativ miljö med stor frihet att välja teknik tillsammans med ditt team eller den mobb du arbetar i och det kräver att du är en lagspelare som triggas av att arbeta kreativt och flexibelt i nära samarbete och dialog med andra. Samtidigt är det såklart också viktigt att du håller ögat på målet och säkerställer att de val vi gör hela tiden tar oss närmre slutmålet. Vi är rätt säkra på att vi har ett vinnande arbetssätt (det verkar som det hittills), men vi kommer alltid vilja att du bidrar med din kunskap och expertis kring nya tekniker, nya arbetssätt och idéer för att utmana oss och se om vi kan bli ännu bättre. Eftersom vi inte bara bygger en helt egen plattform från grunden utan också ser till att ha roligt tillsammans medan vi gör det så vill vi självklart att du också är en person som bidrar med energi och engagemang!\nÖVRIG INFORMATION\n\n\nStart: Enlig överenskommelse\n\n\nOmfattning: Heltid, tillsvidare med inledande provanställning\n\n\nPlacering: Group IT, Hälsingegatan, Stockholm (här finns vårt trevliga kontor, men är du rätt person så är vi öppna för arbete på distans, även om vi tycker det skulle vara absolut roligast att få träffa dig IRL ibland)\n\n\nKontaktuppgifter: Elin Karman (Recruitment Consultant), <a href=\"elin.karman@academicwork.se\">elin.karman@academicwork.se</a>\n\n\nSök tjänsten genom att klicka på Ansök via annan site nedan. Vi går igenom urvalet löpande och annonsen kan stängas ner innan tjänsten är tillsatt om vi gått över till urvals och intervjufasen. Observera att denna ansökan sker via en extern site vilket gör att den inte kommer att synas under ”mina sidor” på din profil. Rekryteringsprocessen består av kompetensbaserade intervjuer, tester samt arbetsprov.\n\n\nVi tar inte emot ansökningar via mail men har du specifika frågor kring tjänsten besvaras dessa på <a href=\"recruitmentstockholmsouth@academicwork.se\">recruitmentstockholmsouth@academicwork.se</a> under kontorstid. Skriv annonstiteln i rubriken och kopiera gärna in länken till annonsen i ditt mail. För generella funderingar kring din ansökan/vår rekryteringsprocess finns vi ofta tillgängliga i chatten här på webben under vardagar så hör gärna av dig där!\n\n\nInformation om företaget\nDet finns IT-avdelningar och så finns det IT-avdelningar. Och så finns det Group IT på Academic Work. Genom åren har vi kommit att bli något ganska unikt, mycket tack vare att vi redan från början haft ett stort fokus på att ligga i framkant i vår bransch när det kommer till digitalisering. Academic Work satsar mycket på IT och hos oss får du arbeta med den senaste teknologin inom områden där du har möjlighet att påverka utveckling av både produkter och processer. Vår IT-strategi är mycket ovanlig och något som vi är extremt stolta över!\nAcademic Work är Home of the young professionals. Vi rekryterar och hyr ut young professionals – studenter och akademiker som befinner sig i början av karriären. Academic Work startades av tre studenter som levde sin egen affärsidé. Nu är vi en internationell verksamhet där young professionals påbörjar sina karriärer, varje dag. Läs mer på <a href=\"https://www.academicwork.se/\">www.academicwork.se</a>.\n",
    "how_to_apply": "<a href=\"https://jobs.academicwork.se/annons/fullstackutvecklare-till-group-it-pa-academic-work/15045291\">https://jobs.academicwork.se/annons/fullstackutvecklare-till-group-it-pa-academic-work/15045291</a>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcldMIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ab88a4a0478cb8fd92976260b66088e5e56c0781/AW_logo_main_version_RGB.png"
  },
  {
    "id": "77468823-d7bb-4889-9f0a-68324740df26",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/77468823-d7bb-4889-9f0a-68324740df26",
    "created_at": "Thu Oct 08 22:14:34 UTC 2020",
    "company": "PinPoint Recruiting Solutions",
    "company_url": "http://http",
    "location": "Remote",
    "title": "Frontend Technical Lead",
    "description": "Lead Software Engineer, JavaScript/Front-End\nDo you have the drive and desire to join an early stage startup, take on significant ownership, and build something amazing? Want to be employee #4!  Work with experienced founders who have prior success with building savvy tech in both prior companies and most recently with a startup that was sold to a fortune 500 company.\nProduct:  Will revolutionize the way data scientists build next-generation AI technology.\nYou are a JavaScript pro with a real passion for building things that are fast and easy to use. You are able to make trade-offs between when to use external packages or frameworks and when to write low level JavaScript and you are comfortable with both.\nExperience:\n\nStrong Object Orientated JavaScript development for multiple browsers\nExpertise with JavaScript technologies such as Node.js, React, Grunt/Gulp/Webpack, TypeScript, Cyprus, Karma, Selenium, BrowserStack\nExpertise in all aspects of software development, e.g. architecture, design, implementation, and testing\nExperience developing online IDEs , e.g. JupyterLab, vscode, Theia\nBuilding scalable and performant web applications\nLeading technical projects or being a technical lead\nExperience with shipping multiple products\nExperience with building front end from scratch\n\n",
    "how_to_apply": "email   <a href=\"mailto:loribarry01@gmail.com\">loribarry01@gmail.com</a>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBckNMIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ae62c8ae1b555ce885be6c3b7df05b2082a7ee1d/8861058.jpg"
  },
  {
    "id": "d98ef1c8-0559-4784-a18c-12f0b21d0315",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/d98ef1c8-0559-4784-a18c-12f0b21d0315",
    "created_at": "Mon Oct 05 16:37:44 UTC 2020",
    "company": "Agrian Inc.",
    "company_url": "http://www.agrian.com",
    "location": "Fresno, CA",
    "title": "Software Engineer - Web UI",
    "description": "Position:  Software Engineer - Web UI\nLocation: U.S.\nDepartment: Engineering\nABOUT THE POSITION:\nAgrian is looking for an experienced front-end developer to help us build out our next generation of products. We’re writing an ambitious front end that’s built around modern Ember and is written in TypeScript. We pride ourselves on being up to date in best practices in coding, testing, and deployment strategies.\nYou’ll work directly with Product Management, User Experience, Engineering, and QA in a company that takes pride in quickly delivering groundbreaking solutions to its clients. You can find out more about our technology stack at this talk given at EmberConf 2020.\nThe position is ideally based in our Clovis, CA headquarters, but the role will be remote for the foreseeable future.\nVirtual EmberConf 2020: Taming the Beast: Managing a really ambitious codebase by Luke Deniston\nREQUIREMENTS:\nExtensive JavaScript experience with a focus on building large, complex single-page applications\nProficient in at least one modern JavaScript framework such as Ember (preferred), Svelte, Angular, or Vue\nAble to debug and optimize cross-browser and platform web applications (for desktop and mobile)\nExperience with Node-based CLI tools, JS build tools, and automated testing frameworks (QUnit, Mocha, Jasmine, etc.)\nComfortable with Git/version control workflows\nNICE TO HAVES:\nAbility to bring custom and responsive designs to life using technologies like PostCSS, Sass or Less, and frameworks like Tailwind or Bootstrap.\nKnowledge and passion for design and UX principles of web and mobile interfaces\nExperience with TypeScript (preferred) or Flow\nExperience with OpenLayers, Leaflet or other web mapping tools\nExperience with D3, Vega, or other visualization libraries\nExperience with Ruby on Rails\nWhen filling out your application, be sure to include a short letter as to why you're interested in the role and please include a link to a git repo so we can review some code samples.\nPHYSICAL DEMANDS:\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.  Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nWhile performing the duties of this job, the employee may be required to climb or balance, and is regularly required to talk or hear or smell.\nThe employee is occasionally required to stand; walk; sit; use hands to finger, handle, or feel objects, tools, or controls; reach with hands and arms; and stoop, kneel, or crouch.\nThe employee must occasionally lift and/or move up to 10 pounds.\nSpecific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to adjust focus.\nWORK ENVIRONMENT:\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nTelecommuting\nTravel can be approximately 25-50%\nThe noise level in the work environment is usually moderate.\nEmployment Type: Full Time\nFunctional Area: Non-Management\nA Little About Us\nFounded in 2004, Agrian Inc. offers the most integrated solution to the growing demand for information addressing food safety, environmental concerns, traceability, sustainability, and locally and organically grown food. Agrian’s mission is to make technology work better for those working in Agriculture. We are turning the Agriculture marketplace upside down by providing SaaS products that deliver high value and improve efficiencies. We have well over 60,000+ customers.\nAgrian is a Fresno-based company with over 120 employees and offices in La Salle, Manitoba, Canada; Yerevan, Armenia; and Kathmandu, Nepal. Our mobile app has received national recognition and our employee retention is exceptional. More importantly, we provide challenging work, opportunities to learn, high-quality teammates, a standard-setting product, and a company on the move.\n",
    "how_to_apply": "<a href=\"https://home.agrian.com/company/careers/\">https://home.agrian.com/company/careers/</a>\n",
    "company_logo": null
  },
  {
    "id": "421871bb-05d3-4fbe-b00c-3f372fa35584",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/421871bb-05d3-4fbe-b00c-3f372fa35584",
    "created_at": "Tue Aug 04 17:23:12 UTC 2020",
    "company": "Sticker Mule",
    "company_url": "https://www.stickermule.com/careers",
    "location": "Anywhere",
    "title": "Javascript Engineer",
    "description": "About Sticker Mule\nSticker Mule is the Internet's most \"kick ass\" brand. We are privately-owned, profitable, and powered by a  globally distributed team who cares deeply about delivering a great customer experience at the highest technical standards. Our software team operates from 17 countries, and we're always looking for more exceptional engineers.\nThe Software team is responsible for building and maintaining our front-end and back-end services, developing new features and products, and troubleshooting problems.\n<a href=\"https://www.stickermule.com/about\">See more about our teams here</a>\nWe offer\n<ol>\nRemote work with flexible schedules\nVaried, interesting technical challenges to solve\nA fun \"no bullshit\" work environment\n</ol>\nWe like you to know\n<ol>\nDocker\nNextJS\nReact\nNodeJS\nGraphQL\nPostgres\nRedis\nFamiliarity with Ruby\nExcellent communication skills (English)\nDegree in Computer Science or equivalent practical experience\n</ol>\nChallenges\n<ol>\nImprove and expand our React shared components gallery\nMigrate a large Rails code base to JavaScript from front-ends and back-ends\nMaintain optimal front-end performance on desktop and mobile\n</ol>\nCompensation and benefits\n<ol>\n$99,000-$135,000+\n$10,000 signing bonus\n4 weeks vacation\n</ol>\n",
    "how_to_apply": "Apply here only: <a href=\"https://www.stickermule.com/career/7e6bb5ee-9953-4d46-b008-77a3bbc4ee29\">https://www.stickermule.com/career/7e6bb5ee-9953-4d46-b008-77a3bbc4ee29</a>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3VIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--04344d944b21465d33ecd7bd62098692640a8658/herman%206.jpg"
  },
  {
    "id": "c9e82948-69d1-446d-8964-fbb1f0be82c2",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/c9e82948-69d1-446d-8964-fbb1f0be82c2",
    "created_at": "Fri Oct 02 13:08:51 UTC 2020",
    "company": "Slite",
    "company_url": "http://www.slite.com",
    "location": "Remote",
    "title": "Senior Growth Engineer",
    "description": "We’re looking for a passionate engineer with skills and experience in growth to build Slite's long-term sustainable growth with us.\nSustaining long-term growth and reaching hundreds of millions of users requires a scientific approach to growth. In fact, growth experts resoundingly say that “growth hacking” isn’t in their vocabulary or something they relate to their work. “Hacking” implies a haphazard / gut-driven approach, and the reality is quite the opposite. Startups that have seen amazing growth have developed teams and processes that are intentional, exceedingly metrics-driven, and thrive on experimentation.\nSource: Article from the Y Combinator blog\nIf this quote speaks to you, you've come to the right place! Our product is our first and biggest growth opportunity. Slite is made for people to create valuable content that they're proud and excited to share with the rest of their teams: that'll be our best ambassador and source of acquisition.\n💪 What's my mission?\nIn the Growth Team, every experiment we launch aims at helping Slite grow!\nYou will be part of a technical team with a business mindset, figuring out how we can innovate to increase Slite's growth. As a growth engineer, you'll be able to see the impact of your code on the business.\nYou will focus on delivering experiments to accelerate Slite's growth.\nYou will launch initiatives to maintain and scale the growth engineering stack.\nYou will improve metrics, analytics, and experimentation infrastructures.\nYou will have the opportunity to help prioritize\nEventually, as one of the early members of Slite, you'll be able to shape the future of it. We share as much ownership on the way we work and on the product itself as we can as we're convinced our success is 99% due to our team.\n📖 What do I need?\nBe a self-starter - you are a confirmed developer who is able to show initiative and get things going without too much guidance.\nExcellent engineer - you understand and advocate for testing, analytics, observability, error tolerance.\nFull-stack JS engineer - you have a significant front-end and back-end development experience using React, Node.js.\nGrowth mindset - Understand business KPIs and the end goal. Can challenge growth experiments, propose simpler implementation to fasten the iterations, can propose excellent technical decisions to improve user experience.\nGood communication skills - you write clearly about technical or product-related subjects. You are able to challenge subjects in a guided direction.\nPragmatic thinking - you can take tactic decisions when needed, dealing with debt and payback later. You are able to keep a long term vision via a long-term strategy\n🤗  Who will I be working with?\nYou will be working closely with all members of the growth squad, Adrien our Growth PM, Anthony our first senior growth engineer and Rob, senior growth designer.\nYou'll interact too with Laure, our product marketer and Brieuc, our Customer Success lead as well as other squads.\nWhy join Slite?\nOn what we do, check out slite.com and if you're not a Slite user yet, give it a spin 🌀\nMore importantly, why we’re building Slite: we help teams work in more thoughtful manners, based on written culture, information transparency, asynchronous collaboration. And because of that, we unlock remote for them.\nWe work by these principles and evangelize on them.\nWork with talented &amp; passionate people with diverse experiences and backgrounds\nMake a dent: we strive to shift the way people collaborate and organize at a large scale, potentially impacting millions of people\nFeel your impact: Slite is still early stage, everything we do matters and your impact is critical\nBenefits\n🤩 Competitive salary and equity\n🏝 5 Weeks PTO + 11 French Holidays 🇫🇷\n📚 Buy any book policy\n🖥️ Remote setup: coworking or at-home setup, your pick. Slite covers your expenses.\n🌈 We go on team offslites every 4 months\n💻 Macbook: a new laptop for a new job\nDiversity of talents, opinions, and backgrounds does matter to us. We are actively working at diversifying our team, that’s one of the reasons we chose to be remote and create a writing tool that is used in diverse locations and by a lot of different users. If you don’t match the people on the team picture, please do not hesitate to apply or contact us!\n",
    "how_to_apply": "<a href=\"https://slitejobs.teamtailor.com/jobs/931952-senior-growth-engineer\">https://slitejobs.teamtailor.com/jobs/931952-senior-growth-engineer</a>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbktMIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e788b17bdc5d8b8b72cd4893b81b9fb9daa8e968/logo_old.png"
  },
  {
    "id": "e084e62f-1a58-453c-bf41-406c1180b56f",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/e084e62f-1a58-453c-bf41-406c1180b56f",
    "created_at": "Tue Sep 01 16:01:11 UTC 2020",
    "company": "Lenus eHealth",
    "company_url": "https://www.lenusehealth.com/",
    "location": "Copenhagen",
    "title": "Senior Web Developer",
    "description": "Shape the future of the sports and fitness industry\nLenus eHealth helps fitness professionals build a strong and sustainable business by offering them an all-in-one platform for online coaching together with advisory on business development, marketing and personal branding. The digital product offering includes a full-suite CRM solution for personal trainers to manage their clients, as well as coach-branded web and mobile apps for end-users to receive programmes for meals and workouts, track progress over time and communicate with the coach.\nFounded in 2016, Lenus eHealth are currently the market leaders in Denmark and Sweden and are at a low start to take over new countries. Proud to have already helped people lose over 100 000 kg, they are confident that this number will grow exponentially following an international expansion.\nThe tech stack you'll meet\nReact, Node.JS, GraphQL, PostgreSQL, TypeScript, ReasonML, React Native (Expo - Managed &amp; Bare Workflow), React Native Web and ReasonReact.\nHelp move a market-leading product forward\nLenus is looking for a Senior Web Developer who loves to code and who has a product-oriented focus. In return, you will have a great influence on the code written and you will ensure that good software engineering practices are adopted and followed: design, testing, documentation, deployment, and operations. You will be in close cooperation with the Tech Lead, support the delivery lifecycle and help ensure that immediate issues are solved quickly and efficiently.\nAs a Senior Web Developer, your mission will be to help move Lenus’ product efforts forward by either participating in or leading their product development projects. You will own key components within the platform: In this case, “owning\" means envisioning, designing, creating, building, and supporting.\nFurthermore, Lenus envisions that you will join and lead discussions around different platform initiatives and occasionally take charge of troubleshooting and maintaining high quality and low bug count in their core products. If you’re interested and motivated by mentorship responsibilities, Lenus will support your aspirations.\nYour qualifications as a Senior Web Developer\nIdeally, you are an engineer at heart <a href=\"https://www.notion.so/lenus/Engineers-at-heart-6232f941df4b4b26828c4ca578abb83f\">(click here to read about values, work culture and tech-stack)</a> and possess most of the following skills and personal qualifications:\n\nHave 5 or more years of experience in software development.\nAre an expert in either frontend or backend domain.\nHave a great sense of ownership and experience with taking charge of development projects.\nHave solid written and verbal communication, are able to clearly articulate technically complex problems and solutions to both technical and non-technical colleagues.\nHave experience in working with relational databases like PostgreSQL.\nAttentive to detail with a high focus on writing high quality, maintainable code.\nAre a true believer and a practitioner of automated testing at all levels.\nAre willing to pick up new technologies and frameworks and implement them with the team when required.\n\nJoin a diverse engineering team and a growing company\nThe people at Lenus work and workout together, they celebrate their achievements together and are connected on a deeper level than just being colleagues. The current team of 10 developers is spread across 4 nationalities. The team is a young, technology-loving, music playing, ramen eating group and they work hard, workout hard, and occasionally, party hard - a social and fun workplace is certainly valued.  You will be able to develop yourself in the direction you prefer. In a growing team, there will be a demand for both a high degree of specialisation as well as a broader perspective of a generalist.\nLastly, Lenus is financially stable, thanks to fast-growing monthly recurring revenues (currently around 16M DKK/Month) and MtM growth of ca. 10%. Therefore, they are able to offer more than competitive pay to the candidates with the right values and set of competencies.\nAbout the hiring process\nKold+Partners is handling the recruiting process. Our process is fast, transparent and tailored to your needs. We are conscious of your time and the fact that you are busy in your daily life. Read more about our approach and your journey as a candidate here.\nIf you have any questions regarding the job or Lenus eHealth, feel free to contact Peter Kold on +45 29 89 09 03 or at <a href=\"mailto:peter@koldpartners.com\">peter@koldpartners.com</a> and Valdemar Jørgensen on +45 42 22 72 68 or at <a href=\"mailto:valdemar@koldpartners.com\">valdemar@koldpartners.com</a>.\n",
    "how_to_apply": "<a href=\"https://jobs.lever.co/koldpartners/ee79db60-e3e1-4967-a7b9-2518c83e33d4?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">CLICK HERE</a>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0tKIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3ca798af9d1dddd185dd05a9605606665e213889/Lenus-Logo-2020%20(1)-p-500.png"
  },
  {
    "id": "f2b95759-2410-4ab2-bce1-b84c5d6530bb",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f2b95759-2410-4ab2-bce1-b84c5d6530bb",
    "created_at": "Thu Oct 01 08:23:15 UTC 2020",
    "company": "Testlio",
    "company_url": "https://testlio.com/about-us/",
    "location": "Tallinn, Estonia or remote",
    "title": "Senior Software Engineer",
    "description": "We are looking for strong software engineers to meet the challenges of a growing company. Our software engineers are responsible for building modern and fast single page web applications and microservices with REST APIs, using tools like Node.js, GraphQL, React, AWS, the Flux application architecture, SCSS and more</em>.\nYou will be a part of a product team that is focused on one of the areas of Testlio roadmap and owning it end-to-end as much as possible to reduce dependencies. You will closely work with product manager, designer, and other engineers to implement necessary features for the Testlio platform. You will be able to dig into various parts of application development as well as give your voice in architecture-related decisions.\nKey responsibilities:\n\nDesign and implement modern single page applications and REST microservices using Node.js, PHP, ES6, GraphQL, React and the Flux architecture.\nPartner with Product Manager and Design to solve problems - get things done and enable value proposition.\nOwn, operate and maintain your team's services across all development environments, including production.\nBe proud of your work. Beside good code, you also value the impact and seek for validation via telemetry or direct customer feedback.\nEager to learn continuously new things. You celebrate if you can learn new things, regardless which matter (e.g. business, technology or some good anecdote).\n\nWhat do we expect from you?\n\nYou are a team player - individual goals come second, team goals come first.\nYou have experience of building web applications.\nProven track record of success and failures - we believe in experience and learning. Not everything goes right. You know your failures, learned from it and know how to avoid it.\nKnowledge and experience in JavaScript, Node.js, React, HTML, CSS.\nExperience with version control systems, preferably Git and Github.\nExperience building and working with REST and/or HTTP API's.\nKnowledge of relational databases and data modeling.\nFull English professional proficiency.\n\nWhat we can offer?\n\nYou have a chance to help deliver the mission for some of the biggest companies in the world by building dedicated test management platform.\nOpportunity to learn constantly in a multicultural environment and grow tremendously.\nA fast, transparent and supportive team.\nWe will take good care of you by compensating sport activities and educational training (or attending seminars interesting to you), good food, relaxing massages etc.\nNot to mention, you’ll be part of an amazing pride of lions – check out our latest <a href=\"https://www.youtube.com/watch?v=fNGB9mzuQyA\">Lionfest video</a> and be updated with what’s going on <a href=\"https://www.instagram.com/testlio/\">atm</a>.\n\n",
    "how_to_apply": "You can apply on our job page - <a href=\"https://testlio.com/jobs/#software-engineer\">https://testlio.com/jobs/#software-engineer</a> and/or share your CV directly via email - <a href=\"mailto:nadezhda@testlio.com\">nadezhda@testlio.com</a>.\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHVMIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--96a5c847c04b0718219ea3b74f0fd0bfcb1a226a/testlio-mark-blue.png"
  },
  {
    "id": "2dff2bf0-6f95-4fb9-846e-415fa6e25cb8",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/2dff2bf0-6f95-4fb9-846e-415fa6e25cb8",
    "created_at": "Wed Sep 30 20:18:15 UTC 2020",
    "company": "Formidable",
    "company_url": "http://www.formidable.com",
    "location": "Remote-US",
    "title": "Cloud Infrastructure Engineer - Formidable (Remote)",
    "description": "Formidable is a boutique engineering consultancy and open source software organization, specializing in React.js, React Native, GraphQL, Node.js, and the architecture of large-scale JavaScript applications. We are a team of consultants working together to find holistic and sustainable solutions to challenging software and process problems for our clients. We build products for some of the world’s biggest companies while helping their internal teams develop the skillset to create and maintain thoughtful and scalable systems.\nWe are looking for a Cloud Infrastructure Engineer to join the Formidable as a remote employee. You will help clients build cloud platforms at-scale, assisting in every part of the process, from concept to production. The cloud landscape is continuously evolving, with new tools and services being released daily. You know how to distinguish hype from reality and are comfortable making recommendations that best suit our clients’ needs.\nFormidable’s growing platform team has experience with all major cloud providers. You are comfortable leading teams and mentoring engineers in core concepts like high-availability, scalability, and monitoring. You know architecture is more than just drawing boxes, and are excited to dive in and lead by getting your hands dirty. We're a JavaScript-first consultancy and you'll help engineers implement your vision using Node.js on the server.\nWe make sure our employees get opportunities to grow within Formidable and participate in daily decision-making processes. Our engineers are leaders in the community and frequently speak at key conferences. Working with other Formidables, you are guaranteed to continually cultivate your skill set by staying atop of industry trends and tools.\nThis role is a Formidable full-time position. It will be a remote, work-from-home role.\nIf you’re interested in joining a collaborative community that supports employees and understands the importance of maintaining a work-life balance, we would love to talk to you!\nYou Have\n\nAn interest in working in a client service role – advocating for the positive long-term impacts of code health and smooth developer experience, while being sensitive to client goals and timelines\nConfidence in picking the right tool for the job (Kubernetes / Docker / Lambda)\nUnderstanding of high availability, monitoring, and reporting, incorporating them into each project from the very beginning\nAble to recommend and design CI/CD solutions\nComfortable communicating architectural concepts to clients and team members alike\nDedication to diversity and inclusivity in the industry\nPatience and drive to both learn from and mentor others\n\nExperienced In\n\nArchitecting and building cloud solutions on AWS / Azure / GCP\nBuilding scalable production systems from start to finish; beginning by identifying business needs and taking the project through to its launch\nImplementing CI/CD pipelines (Gitlab, Jenkins, CircleCI)\nKubernetes / Lambda / Containerization\nTerraform and infrastructure as code best practices\nOne or more scripting languages (Bash, JavaScript, etc)\nVersion control for code collaboration on teams\n4+ years of professional software development experience\n2+ years of professional experience in cloud infrastructure\n\nExtra Credit\n\nExperience leading teams\nFamiliarity with JavaScript\nFamiliarity with GraphQL\nFamiliarity with React\nOpen Source contributor\n\nWhat We Offer Our Remote Employees\n\nThree weeks of PTO annually and unlimited sick time\nComprehensive Medical, Dental, and Vision\nFlexible work schedules\nAnnual Health &amp; Wellness bonus\nA supportive and collaborative internal culture\n...And much more to support your life, both during and outside of work!\n\nInclusion is one of our core values. We don’t discriminate by race, religion, national origin, gender identity, sexual orientation, age, marital status, veteran status, or disability status.\nAll persons hired will be required to verify identity and eligibility to work in the US. No visa sponsorships are currently provided.\n",
    "how_to_apply": "Email your resume to <a href=\"mailto:jeff.graves@formidable.com\">jeff.graves@formidable.com</a>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbE9MIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4cabfb598bbb3f98ec48516242fde1509b89048f/formidable%20logo.png"
  },
  {
    "id": "3a591fde-815f-45e7-81e9-9781de9596a5",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/3a591fde-815f-45e7-81e9-9781de9596a5",
    "created_at": "Tue Sep 29 08:16:40 UTC 2020",
    "company": "Stingray Marine Solutions",
    "company_url": "https://www.stingray.no/",
    "location": "Oslo",
    "title": "Applikasjonsutvikler med erfaring søkes til Stingray Marine Solutions",
    "description": "Vil du være med på å skape høyteknologiske løsninger som setter spor etter seg? Hvis svaret er ja, og du i tillegg ønsker å være med på utviklingsprosessene fra A til Å, så tror vi at du ville passet godt inn i vårt team.\nInformasjon om stillingen\nMed høyteknologiske løsninger for havbruk- og oppdrettsnæring, behøves også gode brukevennlige applikasjoner. <a href=\"https://www.stingray.no/\">Stingray Marine Solutions</a> har et sterkt fagmiljø på flere fagområder, og skal nå styrke sitt team av Applikasjonsutviklere.\nVi søker nå Fullstack Applikasjonsutvikler som med sin kompetanse vil være en del av utviklingen av nye og eksisterende løsninger. Du vil fokusere på backend-delen av applikasjonene, og vil få jobbe med utrolig mye spennende og ny teknologi - fra utvikling i .NET til arkitektur, sikkerhet og utvikling av førsteklasses skyløsninger. Alt til rette for at du skal lage de beste løsningene for våre tjenester.\nI dag er vi over 60 ansatte, hvorav omtrent 20 er utviklere - og vi skal bli flere!\nMen hva lager vi?\nStingray lager ROV-noder som settes i merdene på oppdrettsanlegg, og fjerner lakselus på fisken som svømmer forbi ved å skyte trackende laserpulser. I tillegg teller vi alle lus i forskjellige stadier i bildebasert lusetelling, diagnostiserer fiskehelsen (sår, adferd, kjønnsmodning m.m.) og veier fisken idet den passerer systemet. Mange snakker om maskinlæring, kunstig intelligens, AI og nevrale nettverk. Her i Stingray bruker og videreutvikler vi dette real-time, hver dag i praksis. I Stingray både bygger vi roboten og lager programvaren den kjører.\nVi søker deg som\nVi søker deg som besitter noen års erfaring med applikasjonsutvikling, og som den siste tiden har fått sansen for å jobbe fullstack. Du har derfor:\n\nErfaring med applikasjonsutvikling, backend og frontend\nGod erfaring med .NET utvikling\nErfaring med skyløsninger. Fordel med AWS erfaring\nTrives med å jobbe på både korte sprinter og mer langsiktige prosjekt\n\nHos oss får du også jobbe med masse annen teknologi og verktøy. Et knippe av disse:\n\nReact\nNode.js\nKubernetes\nElasticsearch\n\nAnnet\nSom tiltak i forbindelse med Covid-19 har Stingray på plass et godt opplegg for deg uavhengig om du ønsker hjemmekontor i perioder eller vil sitte sammen med kolleger på kontoret.\n\nSøknadsfrist: 09.10.2020.\nRekrutteringsprosessen utføres av Academic Work på vegne av Stingray Marine Solutions. Du vil bli fast ansatt i Stingray. Kontakt <a href=\"mailto:rudi.riis@academicwork.no\">rudi.riis@academicwork.no</a> ved eventuelle spørsmål.\n\nInformasjon om bedriften\nStingray Marine Solutions AS bygger på gründer Esben Beck sin patenterte idè fra 2010 for fjerning av lakselus ved bruk av kamerasyn og laser.\nSiden oktober 2014 har selskapet vært kommersielle med en høyteknologisk løsning for fjerning av lakselus i oppdrett av laks og ørret. Over 400 lasere har blitt produsert for installasjon og drift langs hele kysten av Norge. Over 20 oppdrettsselskaper benytter selskapets produkter og tjenester, slik at de har bedre lusekontroll i sine anlegg. Stingray har internasjonale vekstambisjoner og solid økonomi.\nSelskapet holder til i Groruddalen i Oslo og har per dags dato over 60 ansatte. Produksjon, montasje, service og oppfølging skjer fra hovedkontoret i Oslo, hvor vi nå har bygget et sterkt fagmiljø innenfor oppdrettsteknologi, fiskebiologi og software. Vi har et godt sosialt inkluderende miljø, med klatregrupper, fotballtreninger m.m.\n",
    "how_to_apply": "Apply here: <a href=\"https://jobs.academicwork.no/annons/applikasjonsutvikler-med-erfaring-skes-til-stingray-marine-solutions/15045263\">https://jobs.academicwork.no/annons/applikasjonsutvikler-med-erfaring-skes-til-stingray-marine-solutions/15045263</a>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGlMIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a7db395e831636b14ce5ea637585eb1300135063/3cbe7db8-5c17-4a0f-a085-84034466cddf.png"
  },
  {
    "id": "1d38de06-6f95-4c47-bc65-443be6be1f49",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/1d38de06-6f95-4c47-bc65-443be6be1f49",
    "created_at": "Thu Sep 24 08:29:38 UTC 2020",
    "company": "Laserhub GmbH",
    "company_url": "https://laserhub.com/",
    "location": "Remote",
    "title": "Senior Backend Developer (m/f/x) JavaScript",
    "description": "At Laserhub, we have metal running through our veins, and with our procurement platform for metal parts we are leading the very traditional sheet metal industry into the glorious age of full digitalization. At laserhub.com, end customers and metal parts manufacturers come together via a lean, digital process. Instead of spending many days or weeks on a single order, everyone can work with unprecedented efficiency, fulfilling their demands just in a few days and for multiple orders. Since 2017, our team of experts has demonstrated that our concept is well received by the market – now we want to play a big part in making the entire metalworking industry digital. To achieve our goals, we are looking for an excellent employee for our engineering team as\nSenior Backend Developer (m/f/x) JavaScript\nIn this position, you will work in our B2B commerce squad, focusing on our customers’ real-time quoting engine for 2D/3D CAD models, pricing algorithm, e-commerce services and further growth hacks.\nYour mission:\n\nBuild something lasting for a decade, changing an industry’s way of working\nLove to use the variety of tools out there to actually improve architecture and code base every day\nWork with or integrate new leading-edge technologies keeps you motivated\nScale and run a platform to enable a multi-billion business together with an exceptional team\nEmpower yourself, engage with your team, get better every day\n\nYour profile:\n\n5+ years of experience as freelancer or full-time employee\nYou were at least once responsible for a medium/large scale backend application\nYou love patterns and complex challenges, you know how to evaluate solutions and how to choose the right one based on experience and clever decision making\nYou know how to handle and scale a cloud tech stack: Node.js, Mongo/MySQL, AWS (S3, SQS, RDS, etc.), Heroku, Docker, ElasticSearch, Sequelize ORM, InversifyJS\nYou love if everything is automated - as much as we do (Terraform, Gitlab CI/CD, Cypress Tests among others)\nYou can work on your own, but you love to share your knowledge and work with the team\n\nWhy Laserhub?\n\nA one-time opportunity to help build an exciting B2B business model with scaling potential\nWe believe in fairness, transparency and helpfulness in everyday work\nYour personal development is important to us, therefore we promote the internal transfer of knowledge and strengthen your “zone of genius\"\nAll our employees hold company shares in Laserhub\nYou can arrange your working day according to your needs with flexible working hours, home office days, and the No-Meeting-Wednesday\n\nWhat will happen in the first 3 months at Laserhub\n\nYou will join our B2B commerce squad working at the core of our business\nWe make sure, that you will deploy your first commit at least in the first week\nAfter 4 weeks, you made an impact to our quoting engine and understand why customers love it\nBy then, we will hand-over dedicated responsibilities (ownership of components/services, release management, etc.)\nAfter 3 months, you impressed us with performance improvements that customers benefit from every day\nAlong the way, you will be onboarded by a buddy, guided by your team lead and mentored by our chapter leads\nEarly on, you understood why we are so proud of our culture - so you will embrace it\n\nLocation: Remote or Stuttgart | Starting date: Immediately\n",
    "how_to_apply": "Upload application here: <a href=\"https://jobs.lever.co/laserhub-2/84f30719-90c1-4631-969a-e356b4cc2633\">https://jobs.lever.co/laserhub-2/84f30719-90c1-4631-969a-e356b4cc2633</a>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdFdLIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4285569c53a14201b1626bae0de50dece5a40af6/logo_forRoundUse.png"
  },
  {
    "id": "bbe73c3f-495b-4e84-a4bd-81d77d2797c9",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/bbe73c3f-495b-4e84-a4bd-81d77d2797c9",
    "created_at": "Mon Sep 21 22:56:20 UTC 2020",
    "company": "Newfront",
    "company_url": "https://www.newfront.com",
    "location": "San Francisco",
    "title": "Engineering Lead (Front-end)",
    "description": "<h2>About the role</h2>\nNewfront is looking for highly skilled engineers to help change the face of insurance by using technology to build incredible, unexpected, and delightful experiences for our clients.\nWe are looking for people who share our passion and belief that the best technology is simple, beautiful, accessible, and usable.\n<h2>About the team</h2>\nWe build products for 3 user groups – our clients, brokers, and the servicing team.\n\n\nClients: We need to design a product that makes their current insurance coverage extremely clear and makes it quick and easy for them to request an update their coverage, get help, or make a claim.\n\nBrokers:  We want to help them turn leads into sales. Insurance brokers are like a sales team in a traditional SaaS company. They need a dashboard that clearly communicates the status of all of their clients, tracks their leads, and shows incoming revenue.\n\nServicing team: This team includes account managers and operations specialists responsible for providing stellar service to our clients.\n\n<h2>What you'll work on</h2>\n\n\nLead the development of product features: You'll be involved during product discovery and you'll contribute to the technical design process.  You are product-minded and able to collaborate with a Product Manager to define the product roadmap and vision.  You'll be responsible for speccing and guiding your team in building out features and infrastructure.\n\nShape business processes: As Newfront is a technology-enabled brokerage, we are looking for new ways to improve business processes by using technology.  You will become the expert on how an area of the business functions and work directly with stakeholders to build optimizations.\n\nDefine technical direction: You will help shape the technical vision and roadmap for a large area of the product. You will also influence best practices and introduce new technologies when appropriate. You'll need to clearly communicate your vision with the team to gain support and a shared understanding of the technologies.\n\nMentor other engineers: You will working with more junior engineers on your team to help them grow and develop their skills.\n\n<h2>Requirements</h2>\n\n\n5+ years of engineering experience. You have previous success developing and shipping a large-scale application with a user-empathetic mindset\n\n2+ years of experience leading an engineering team.  You have proven abilities in providing technical direction for a small to medium team of engineers.\n\nYou're product-minded. You take initiative to understand production intention, team goals, business context, and user problems to propose improvements, eliminate gaps, and reduce risk in the project. You contribute to and drive the teams roadmap with product and design. You meet with stakeholders across the company when needed to eliminate gaps in your knowledge. You work closely with design to make sure that a design is able to be built and that it has a logical system behind it.\n\nSecurity-minded. You have a detailed understanding of security protocols like OAuth2/OIDC/JWT. You understand client-side cookie authentication and JWT. You should have an understanding of front-end security risks and how to mitigate them.\n\nYou're highly skilled with web technologies including JavaScript (React/Node), HTML, and CSS. These are important foundational skills for a front-end engineer and impact everything from performance, to maintainability, to accessibility. You understand which features can be used across the various browsers, you understand how to make a website accessible, and you know how to implement responsive design.\n\nYou have experience architecting complex front-end web applications. We use React/Next.js, but you might have experience with Ember or Angular. You understand the concepts of services, stores, state management, build tools, routing, testing, serverless functions, and API design. You might have experience working with micro front-end applications and you are able to discuss trade-offs when slicing up a front-end app. You have created frameworks and libraries to abstract away complexity in your application to amplify your impact across the team.\n\nYou have some experience with micro-service/cloud and enterprise architecture patterns.  You have an understanding of cloud architecture patterns, like pub-sub and BFF APIs, and are able to work with other engineers to discuss the trade-offs and benefits. While you might not be setting up these systems, you understand how they work, why they're used, and how they can impact front-end app performance, product requirements, and front-end code architecture.\n\nYou have a strong understanding of design: You understand that as a front-end engineer it is your job to help uphold the quality of the product. You're aware that loss of quality is often death by a thousand cuts and you care when elements are a few pixels off. You're able to understand why particular interactions should be used and when and you're able to recommend particular UI patterns to solve user problems. You'll have contributed to or have built design systems in the past.\n\n<h2>Nice To Haves</h2>\n\nProficiency with Typescript, React, Jest, and Next.js.\nExperience with styled-components or similar CSS-in-JS libraries.\nUnderstanding of containerization technologies such as Docker.\nExperience using Vercel to deploy applications.\nExperience with Node.js and/or serverless functions.\n\n<h2>Some of the Technologies We Use</h2>\n\nNodeJS\nTypescript/javascript\nPostgresql\nAWS SNS/SQS\nAWS ECS\nDocker\nReact/Nextjs\nNestJS\nRedis\n\n",
    "how_to_apply": "Apply here: <a href=\"https://jobs.lever.co/newfrontinsurance/852043b5-4da3-4b63-b2c7-66160dc83e58\">https://jobs.lever.co/newfrontinsurance/852043b5-4da3-4b63-b2c7-66160dc83e58</a>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcHlLIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cae18d193e88b53853546190ae67d9cae5b8558b/newfront-logo.png"
  }
]
}